SeanNarvasa-snarvasa/hw_12/feelgood_music/app/views/artists/show.html.erb


          <% @artist.songs.each do |song| %>
---
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]