SeanNarvasa-snarvasa/hw_11/blog/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
     @articles = Article.all                       #Lists all articles

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
---
  def show                                         #Method to show the Article attributes
   @article = Article.find(params[:id])            #GETs the article ID

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit                                         #Method to edit the attributes of Article
    @article = Article.find(params[:id])           #GETs the article ID

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Veggies are good for you"], ["text", "Yo!"], ["created_at", "2015-09-10 00:56:45.373948"], ["updated_at", "2015-09-10 00:56:45.373948"]]
---
  def create
  @article = Article.new(article_params)           #Passes the new article params to @article

    if @article.save                                 #if @article saves to the DB, then

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
  def destroy                                       #Method to destroy an article
    @article = Article.find(params[:id])            #GETS the article ID and stores it in @article
    @article.destroy                                #destroys the article