SeanNarvasa-snarvasa/hw_11/blog/app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "sean"], ["body", "hahahaha"], ["article_id", 4], ["created_at", "2015-09-14 04:23:57.814968"], ["updated_at", "2015-09-14 04:23:57.814968"]]
---
  def create                                                  #method to create a comment
    @article = Article.find(params[:article_id])              #GETs the article_ID
    @comment = @article.comments.create(comment_params)       #creates a comment and links the comment to this article

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT 1  [["article_id", 4], ["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy                                                 #method to destroy a comment
    @article = Article.find(params[:article_id])              #GETs the article ID
    @comment = @article.comments.find(params[:id])            #GETs the associated comment
    @comment.destroy                                          #Destroys the comment