SeanNarvasa-snarvasa/hw_12/feelgood_music/app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "image_url", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @artist = Artist.new(artist_params)
    if @artist.save