SeanNarvasa-snarvasa/hw_12/feelgood_music/app/controllers/reviews_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 6]]
---
  def show
    @review = @reviewable_item.reviews.find(params[:id])

INSERT INTO "reviews" ("rating", "name", "review_body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["rating", 1], ["name", "Sean"], ["review_body", "Great Song"], ["created_at", "2015-09-21 06:18:37.272172"], ["updated_at", "2015-09-21 06:18:37.272172"]]
---
  def create
    @review = @reviewable_item.reviews.create(review_params)