SeanNarvasa-snarvasa/hw_12/feelgood_music/app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "length", "genre", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Drunk In Love"], ["length", "6:21"], ["genre", "Pop"], ["artist_id", 1], ["created_at", "2015-09-21 03:52:18.450252"], ["updated_at", "2015-09-21 03:52:18.450252"]]
---
  def create
    @song = Song.new(song_params)
    if @song.save

DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 5]]
---
  def destroy
    @song = get_song
    @song.destroy